Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter
The serialization structure for AnalysisDesignParameter.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter.AnalysisDesignParameterBase
The analysis design parameter base object.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter.value
The value of the analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter.ToStruct(Tekla.Structures.Analysis.AnalysisDesignParameter)
DO NOT USE! For internal usage only!
analysisDesignParameter:
The source analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter.FromStruct(Tekla.Structures.Analysis.AnalysisDesignParameter)
DO NOT USE! For internal usage only!
analysisDesignParameter:
The target analysis design parameter